In [2]:
%matplotlib inline
#import dependencies
import matplotlib.pyplot as plt
import pandas as pd

#Instantiate locations of data files
cityData = 'Resources/city_data.csv'
rideData = 'Resources/ride_data.csv'

#Reading city_data.csv to a DataFrame
cityDf = pd.read_csv(cityData)
cityDf.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [4]:
#Reading ride_data.csv to a DataFrame
rideDf = pd.read_csv(rideData)
rideDf.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

In [5]:
#checking for missing values
cityDf.count()

city            120
driver_count    120
type            120
dtype: int64

In [6]:
#Checking for missing values
cityDf.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [8]:
#Checking data types
cityDf.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [10]:
#Getting the different city types
cityDf['type'].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [14]:
#Getting the count of "Urban" data points
sum(cityDf['type']=='Urban')

66

In [12]:
#Getting the count of "Rural" data points
sum(cityDf['type']=='Rural')

18

In [13]:
#Getting the count of "Suburban" data points
sum(cityDf['type']=='Suburban')

36

In [15]:
#Checking rideDf for missing values
rideDf.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [16]:
#Checking rideDf for missing values
rideDf.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [17]:
#Checking rideDf data types
rideDf.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [18]:
#Combining the data into a single dataset
pyberDataDf = pd.merge(rideDf, cityDf, how='left', on=['city','city'])
pyberDataDf.head(10)

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
5,South Latoya,2019-03-11 12:26:48,9.52,1994999424437,10,Urban
6,New Paulville,2019-02-27 11:17:56,43.25,793208410091,44,Urban
7,Simpsonburgh,2019-04-26 00:43:24,35.98,111953927754,21,Urban
8,South Karenland,2019-01-08 03:28:48,35.09,7995623208694,4,Urban
9,North Jasmine,2019-03-09 06:26:29,42.81,5327642267789,33,Urban